Revit 2027 API
BRepBuilder.GetResult Method
Overload List
Name | Description
GetResult() |  Get the Solid built by this BRepBuilder. This will clear the built geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
GetResult(ExternalGeometryId, BRepBuilderPersistentIds) |  Get the ExternallyTaggedBRep built by this BRepBuilder. This will clear the built geometry stored in the BRepBuilder. This function will throw if this BRepBuilder hasn't completed building the b-rep. Use IsResultAvailable() to verify that this BRepBuilder contains a valid result.
Top
See Also
Reference
BRepBuilder Class
Autodesk.Revit.DB Namespace